from datetime import datetime
#==============================================================
name=f"{args.model}"+datetime.now().strftime("%Y%m%d-%H%M")
start = "星舰‘奥德赛号’的生命维持系统在第七个跃迁周期突然报警时，凯恩正盯着舷窗外扭曲的星云。那片被称为‘幽灵之舌’的星际尘埃带，比星图上标注的更暗，暗到能吞噬跃迁引擎的微光。他按下通讯器，声音因失重而发飘：‘维修组，B 区氧气循环泵读数异常，重复 ——’"# 生成文本的起始内容
num_samples = 10 # 要生成的样本数量
max_new_tokens = 500 # 生成的最多的token数
temperature = 0.8 # 小于1则更保守，大于1则更激进
top_k = 200 # 生成文本时，只保留概率最高的前 k 个 token
seed = 1337 #随机数种子
device = 'cuda' # 设备，例如：'cpu', 'cuda', 'cuda:0', 'cuda:1'
compile = True # 是否编译
#==============================================================